Project/Toir/src/DataProcessors/торо_РабочееМестоТехническогоСпециалиста/торо_РабочееМестоТехническогоСпециалиста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_РабочееМестоТехническогоСпециалиста</name>
  <attributes>
    <name>ВидДаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Завершенные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Перезаполнить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПроведенные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеПоНаработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическоеОбновление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодчиненныеПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.торо_РемонтныеБригады</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтборПоПодразделению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтборПоКонтрагенту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтборПоБригаде</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтборПоДоговору</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтборПоПодразделениюИсполнителю</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Project/Toir/src/DataProcessors/торо_РабочееМестоТехническогоСпециалиста/Forms/ФормаНастройки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры);
	
	Если Параметры.Свойство("ТаблицаКритичности") Тогда
		ТаблицаКритичности.Загрузить(ПолучитьИзВременногоХранилища(Параметры.ТаблицаКритичности));
		// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
		ИспользоватьВыделениеПо = дс_ПоКритичности();
		//ИспользоватьВыделениеПо = "По критичности";
		// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
		Элементы.ПанельУстановкаПалитры.ТекущаяСтраница = Элементы.ПанельУстановкаПалитры.ПодчиненныеЭлементы.ПалитраПоКритичности;
	ИначеЕсли Параметры.Свойство("ТаблицаПриоритетностиОР") Тогда
		ТаблицаПриоритетностиОР.Загрузить(ПолучитьИзВременногоХранилища(Параметры.ТаблицаПриоритетностиОР));
		// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
		ИспользоватьВыделениеПо = дс_ПоПриоритетуОбъектаРемонта();
		//ИспользоватьВыделениеПо = "По приоритету объекта ремонта";
		// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
		Элементы.ПанельУстановкаПалитры.ТекущаяСтраница = Элементы.ПанельУстановкаПалитры.ПодчиненныеЭлементы.ПалитраПоПриоритетуОР;
	ИначеЕсли Параметры.Свойство("ТаблицаНаработки") Тогда
		ТаблицаНаработки.Загрузить(ПолучитьИзВременногоХранилища(Параметры.ТаблицаНаработки));
		// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
		ИспользоватьВыделениеПо = дс_ПоНаработкеОбъектаРемонта();
		//ИспользоватьВыделениеПо = "По наработке объекта ремонта";
		// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
		Элементы.ПанельУстановкаПалитры.ТекущаяСтраница = Элементы.ПанельУстановкаПалитры.ПодчиненныеЭлементы.ПалитраПоНаработке;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_КритичностьДефекта.Ссылка КАК Критичность
	|ИЗ
	|	Справочник.торо_КритичностьДефекта КАК торо_КритичностьДефекта
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_КритичностьДефекта.Код";
	
	ЦветПоУмолчанию = Новый Цвет(255,255,255);
	
	Если ТаблицаКритичности.Количество() = 0 Тогда
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("Цвет"));
		РезультатЗапроса.Колонки.Добавить("Цвет",Новый ОписаниеТипов(Массив));
		
		РезультатЗапроса.ЗаполнитьЗначения(ЦветПоУмолчанию,"Цвет");
		
		ТаблицаКритичности.Загрузить(РезультатЗапроса);
		
	Иначе 
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			Если ТаблицаКритичности.НайтиСтроки(Новый Структура("Критичность", Выборка.Критичность)).Количество() = 0 Тогда
				Нс = ТаблицаКритичности.Добавить();
				Нс.Критичность = Выборка.Критичность;
				Нс.Цвет = ЦветПоУмолчанию;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ПриоритетыОбъектовРемонта.Ссылка КАК Приоритет
	|ИЗ
	|	Справочник.торо_ПриоритетыОбъектовРемонта КАК торо_ПриоритетыОбъектовРемонта
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_ПриоритетыОбъектовРемонта.Код";
	
	ЦветПоУмолчанию = Новый Цвет(255,255,255);
	
	Если ТаблицаПриоритетностиОР.Количество() = 0 Тогда
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("Цвет"));
		РезультатЗапроса.Колонки.Добавить("Цвет",Новый ОписаниеТипов(Массив));
		
		РезультатЗапроса.ЗаполнитьЗначения(ЦветПоУмолчанию,"Цвет");
		
		ТаблицаПриоритетностиОР.Загрузить(РезультатЗапроса);
		
	Иначе 
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			Если ТаблицаПриоритетностиОР.НайтиСтроки(Новый Структура("Приоритет", Выборка.Приоритет)).Количество() = 0 Тогда
				Нс = ТаблицаПриоритетностиОР.Добавить();
				Нс.Приоритет = Выборка.Приоритет;
				Нс.Цвет = ЦветПоУмолчанию;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ТаблицаНаработки.Количество() = 0 Тогда
		
		НС = ТаблицаНаработки.Добавить();
		НС.Наработка = "Недоработка более 25%";
		НС.Цвет = ЦветПоУмолчанию;
		
		НС = ТаблицаНаработки.Добавить();
		НС.Наработка = "Недоработка от 15% до 25%";
		НС.Цвет = ЦветПоУмолчанию;

		НС = ТаблицаНаработки.Добавить();
		НС.Наработка = "Недоработка менее 15%";
		НС.Цвет = ЦветПоУмолчанию;
		
		НС = ТаблицаНаработки.Добавить();
		НС.Наработка = "Переработка менее 15%";
		НС.Цвет = ЦветПоУмолчанию;
		
		НС = ТаблицаНаработки.Добавить();
		НС.Наработка = "Переработка от 15% до 25%";
		НС.Цвет = ЦветПоУмолчанию;
		
		НС = ТаблицаНаработки.Добавить();
		НС.Наработка = "Переработка более 25%";
		НС.Цвет = ЦветПоУмолчанию;

	КонецЕсли;

	Если Объект.ПериодОбновления = 0 Тогда
	
		Объект.ПериодОбновления = 180;
	
	КонецЕсли;
	
	// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
	Элементы.ИспользоватьВыделениеПо.СписокВыбора.Вставить(0, дс_ПоКритичности(), дс_ПоКритичности());
	Элементы.ИспользоватьВыделениеПо.СписокВыбора.Вставить(1, дс_ПоПриоритетуОбъектаРемонта(), дс_ПоПриоритетуОбъектаРемонта());
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
	//Элементы.ИспользоватьВыделениеПо.СписокВыбора.Вставить(0,"По критичности","По критичности");
	//Элементы.ИспользоватьВыделениеПо.СписокВыбора.Вставить(1,"По приоритету объекта ремонта","По приоритету объекта ремонта");
	// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
	
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
	ИспользоватьВыделениеПо = ?(ЗначениеЗаполнено(ИспользоватьВыделениеПо), ИспользоватьВыделениеПо, дс_ПоКритичности());
	//ИспользоватьВыделениеПо = ?(ЗначениеЗаполнено(ИспользоватьВыделениеПо), ИспользоватьВыделениеПо, "По критичности");
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИспользоватьВыделениеПоОбработкаВыбора(Элементы.ИспользоватьВыделениеПо, ИспользоватьВыделениеПо, Истина);
	фВидДаты = Объект.ВидДаты;
	Элементы.ДатаАктуальности.Доступность = (фВидДаты = 1);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьВыделениеПоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
	Если ВыбранноеЗначение = дс_ПоКритичности() Тогда
	//Если ВыбранноеЗначение = "По критичности" Тогда
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
		
		Элементы.ПанельУстановкаПалитры.ТекущаяСтраница = Элементы.ПанельУстановкаПалитры.ПодчиненныеЭлементы.ПалитраПоКритичности;
		
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 	
	ИначеЕсли ВыбранноеЗначение = дс_ПоПриоритетуОбъектаРемонта() Тогда
	//ИначеЕсли ВыбранноеЗначение = "По приоритету объекта ремонта" Тогда
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
		
		Элементы.ПанельУстановкаПалитры.ТекущаяСтраница = Элементы.ПанельУстановкаПалитры.ПодчиненныеЭлементы.ПалитраПоПриоритетуОР;
		
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 	
	ИначеЕсли ВыбранноеЗначение = дс_ПоНаработкеОбъектаРемонта() Тогда
	//ИначеЕсли ВыбранноеЗначение = "По наработке объекта ремонта" Тогда
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
		
		Элементы.ПанельУстановкаПалитры.ТекущаяСтраница = Элементы.ПанельУстановкаПалитры.ПодчиненныеЭлементы.ПалитраПоНаработке;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВыделениеПоПриИзменении(Элемент)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВидаДатыПриИзменении(Элемент)
	
	флДатаАктуальности = (фВидДаты = 1);
	Если НЕ флДатаАктуальности Тогда
		Объект.ДатаАктуальности = ТекущаяДата();
	КонецЕсли;
	Элементы.ДатаАктуальности.Доступность = флДатаАктуальности;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаКритичности
&НаКлиенте
Процедура ТаблицаКритичностиЦветПриИзменении(Элемент)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Применить(Команда)
	
	СтруктураПараметров = Новый Структура("ВидДаты, ДатаАктуальности, Завершенные, ДанныеПоНаработке, НеПроведенные, ПериодОбновления, АвтоматическоеОбновление, ПлановыйПериод, Периодичность, РежимВыделенияСтрок, ПодчиненныеПодразделения",
	фВидДаты, Объект.ДатаАктуальности, Объект.Завершенные, Объект.ДанныеПоНаработке, Объект.НеПроведенные, Объект.ПериодОбновления, Объект.АвтоматическоеОбновление, Объект.ПлановыйПериод, Объект.Периодичность, ИспользоватьВыделениеПо, Объект.ПодчиненныеПодразделения);
	
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
	Если ИспользоватьВыделениеПо = дс_ПоКритичности() Тогда
	//Если ИспользоватьВыделениеПо = "По критичности" Тогда
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
		ВладелецФормы.ТаблицаКритичности.Очистить();
		Для каждого Стр Из ТаблицаКритичности Цикл
			НС = ВладелецФормы.ТаблицаКритичности.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);
		КонецЦикла;
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
	ИначеЕсли ИспользоватьВыделениеПо = дс_ПоПриоритетуОбъектаРемонта() Тогда
	//ИначеЕсли ИспользоватьВыделениеПо = "По приоритету объекта ремонта" Тогда
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
		ВладелецФормы.ТаблицаПриоритетностиОР.Очистить();
		Для каждого Стр Из ТаблицаПриоритетностиОР Цикл
			НС = ВладелецФормы.ТаблицаПриоритетностиОР.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);
		КонецЦикла;
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 	
	ИначеЕсли ИспользоватьВыделениеПо = дс_ПоНаработкеОбъектаРемонта() Тогда
	//ИначеЕсли ИспользоватьВыделениеПо = "По наработке объекта ремонта" Тогда
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
		ВладелецФормы.ТаблицаНаработки.Очистить();
		Для каждого Стр Из ТаблицаНаработки Цикл
			НС = ВладелецФормы.ТаблицаНаработки.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);
		КонецЦикла;
	КонецЕсли;
	
	Оповестить("ПерезаполнитьТаблицы", СтруктураПараметров);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
	Если ИспользоватьВыделениеПо = дс_ПоКритичности() Тогда
	//Если ИспользоватьВыделениеПо = "По критичности" Тогда
		// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
		Для каждого Стр Из ТаблицаКритичности Цикл
			
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаКритичностиЦвет");
			ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаКритичности.Критичность");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.Критичность;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Стр.Цвет);
			
		КонецЦикла;
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
	ИначеЕсли ИспользоватьВыделениеПо = дс_ПоПриоритетуОбъектаРемонта() Тогда
	//ИначеЕсли ИспользоватьВыделениеПо = "По приоритету объекта ремонта" Тогда
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
		
		Для каждого Стр Из ТаблицаПриоритетностиОР Цикл
			
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаПриоритетностиОРЦвет");
			ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаПриоритетностиОР.Приоритет");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.Приоритет;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Стр.Цвет);
			
		КонецЦикла;
		
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
	ИначеЕсли ИспользоватьВыделениеПо = дс_ПоНаработкеОбъектаРемонта() Тогда
	//ИначеЕсли ИспользоватьВыделениеПо = "По наработке объекта ремонта" Тогда
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
		
		Для каждого Стр Из ТаблицаНаработки Цикл
			
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаНаработкиЦвет");
			ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаНаработки.Отклонение");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.Наработка;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Стр.Цвет);
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

// >> [Деснол] [Ушаков А.Д.] [03.10.2019]
&НаКлиентеНаСервереБезКонтекста
Функция дс_ПоКритичности()
	Возврат НСтр("es='Por criticidad';ru='По критичности';en='By criticality'");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция дс_ПоПриоритетуОбъектаРемонта()
	Возврат НСтр("es='Instalación de reparación prioritaria';ru='По приоритету объекта ремонта';en='By priority of the object of repair'");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция дс_ПоНаработкеОбъектаРемонта()
	Возврат НСтр("es='Sobre el tiempo de funcionamiento del objeto de reparación';ru='По наработке объекта ремонта';en='On operating time of object of repair'");
КонецФункции
// << [Деснол] [Ушаков А.Д.] [03.10.2019] 

#КонецОбласти
